//Spread-оператор (...) - єто способ "развернуть" данніе

// const arr = [1,2,3];
// console.log(arr) // [1,2,3]
// console.log(...arr) // 1 2 3 



// //Поверхностная копия (shallow)
// //Копируются только верхние значения. Вложенніе обьекті - с тем же адресом
// const a = [
//     {x: 1},
//     {x: 2}
// ];

// const b = [...a];
// // b новій массив но внутри лежат те же обьекті


// b[0].x = 100;
// console.log(a[0].x); //100


// const a = [1,2]
// const b = [3,4]
// const c = [...a, ...b];  //[1,2,3,4]
// console.log(c);


// const arr = [1,2];
// const newArr = [...arr,3,4];

